The same issue occurs after https://github.com/hashicorp/terraform-provider-vsphere/pull/1820/commits/a56afd07a33327f2f2ed1e214930297bce2afee3

- Build Clusters with vSAN (TF)
- Configured Disk Groups (Manual)
- Enabled vSphere HA (TF) - CRASH. Same error as seen in issue GH-1205

```console
➜ terraform apply --auto-approve
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_host.hosts0[0]: Reading...
data.vsphere_host.hosts0[2]: Reading...
data.vsphere_host.hosts1[0]: Reading...
data.vsphere_host.hosts0[1]: Reading...
data.vsphere_host.hosts1[1]: Reading...
data.vsphere_host.hosts1[2]: Reading...
data.vsphere_host.hosts1[2]: Read complete after 1s [id=host-14]
data.vsphere_host.hosts0[1]: Read complete after 2s [id=host-16]
data.vsphere_host.hosts1[1]: Read complete after 2s [id=host-9]
data.vsphere_host.hosts0[0]: Read complete after 2s [id=host-12]
data.vsphere_host.hosts0[2]: Read complete after 2s [id=host-24]
data.vsphere_host.hosts1[0]: Read complete after 2s [id=host-17]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_compute_cluster.vsan-cluster0 will be created
  + resource "vsphere_compute_cluster" "vsan-cluster0" {
      + datacenter_id                                         = "datacenter-3"
      + dpm_automation_level                                  = "manual"
      + dpm_enabled                                           = false
      + dpm_threshold                                         = 3
      + drs_automation_level                                  = "manual"
      + drs_enable_vm_overrides                               = true
      + drs_enabled                                           = true
      + drs_migration_threshold                               = 3
      + drs_scale_descendants_shares                          = "disabled"
      + ha_admission_control_host_failure_tolerance           = 1
      + ha_admission_control_performance_tolerance            = 100
      + ha_admission_control_policy                           = "resourcePercentage"
      + ha_admission_control_resource_percentage_auto_compute = true
      + ha_admission_control_resource_percentage_cpu          = 100
      + ha_admission_control_resource_percentage_memory       = 100
      + ha_admission_control_slot_policy_explicit_cpu         = 32
      + ha_admission_control_slot_policy_explicit_memory      = 100
      + ha_datastore_apd_recovery_action                      = "none"
      + ha_datastore_apd_response                             = "disabled"
      + ha_datastore_apd_response_delay                       = 180
      + ha_datastore_pdl_response                             = "disabled"
      + ha_enabled                                            = false
      + ha_heartbeat_datastore_policy                         = "allFeasibleDsWithUserPreference"
      + ha_host_isolation_response                            = "none"
      + ha_host_monitoring                                    = "enabled"
      + ha_vm_component_protection                            = "enabled"
      + ha_vm_dependency_restart_condition                    = "none"
      + ha_vm_failure_interval                                = 30
      + ha_vm_maximum_failure_window                          = -1
      + ha_vm_maximum_resets                                  = 3
      + ha_vm_minimum_uptime                                  = 120
      + ha_vm_monitoring                                      = "vmMonitoringDisabled"
      + ha_vm_restart_priority                                = "medium"
      + ha_vm_restart_timeout                                 = 600
      + host_cluster_exit_timeout                             = 3600
      + host_system_ids                                       = [
          + "host-12",
          + "host-16",
          + "host-24",
        ]
      + id                                                    = (known after apply)
      + name                                                  = "vsan-cluster0"
      + proactive_ha_automation_level                         = "Manual"
      + proactive_ha_moderate_remediation                     = "QuarantineMode"
      + proactive_ha_severe_remediation                       = "QuarantineMode"
      + resource_pool_id                                      = (known after apply)
      + vsan_compression_enabled                              = false
      + vsan_dedup_enabled                                    = false
      + vsan_dit_encryption_enabled                           = false
      + vsan_dit_rekey_interval                               = (known after apply)
      + vsan_enabled                                          = true
      + vsan_network_diagnostic_mode_enabled                  = false
      + vsan_performance_enabled                              = false
      + vsan_unmap_enabled                                    = false
      + vsan_verbose_mode_enabled                             = false

      + vsan_disk_group {
          + cache   = (known after apply)
          + storage = (known after apply)
        }
    }

  # vsphere_compute_cluster.vsan-cluster1 will be created
  + resource "vsphere_compute_cluster" "vsan-cluster1" {
      + datacenter_id                                         = "datacenter-3"
      + dpm_automation_level                                  = "manual"
      + dpm_enabled                                           = false
      + dpm_threshold                                         = 3
      + drs_automation_level                                  = "manual"
      + drs_enable_vm_overrides                               = true
      + drs_enabled                                           = true
      + drs_migration_threshold                               = 3
      + drs_scale_descendants_shares                          = "disabled"
      + ha_admission_control_host_failure_tolerance           = 1
      + ha_admission_control_performance_tolerance            = 100
      + ha_admission_control_policy                           = "resourcePercentage"
      + ha_admission_control_resource_percentage_auto_compute = true
      + ha_admission_control_resource_percentage_cpu          = 100
      + ha_admission_control_resource_percentage_memory       = 100
      + ha_admission_control_slot_policy_explicit_cpu         = 32
      + ha_admission_control_slot_policy_explicit_memory      = 100
      + ha_datastore_apd_recovery_action                      = "none"
      + ha_datastore_apd_response                             = "disabled"
      + ha_datastore_apd_response_delay                       = 180
      + ha_datastore_pdl_response                             = "disabled"
      + ha_enabled                                            = false
      + ha_heartbeat_datastore_policy                         = "allFeasibleDsWithUserPreference"
      + ha_host_isolation_response                            = "none"
      + ha_host_monitoring                                    = "enabled"
      + ha_vm_component_protection                            = "enabled"
      + ha_vm_dependency_restart_condition                    = "none"
      + ha_vm_failure_interval                                = 30
      + ha_vm_maximum_failure_window                          = -1
      + ha_vm_maximum_resets                                  = 3
      + ha_vm_minimum_uptime                                  = 120
      + ha_vm_monitoring                                      = "vmMonitoringDisabled"
      + ha_vm_restart_priority                                = "medium"
      + ha_vm_restart_timeout                                 = 600
      + host_cluster_exit_timeout                             = 3600
      + host_system_ids                                       = [
          + "host-14",
          + "host-17",
          + "host-9",
        ]
      + id                                                    = (known after apply)
      + name                                                  = "vsan-cluster1"
      + proactive_ha_automation_level                         = "Manual"
      + proactive_ha_moderate_remediation                     = "QuarantineMode"
      + proactive_ha_severe_remediation                       = "QuarantineMode"
      + resource_pool_id                                      = (known after apply)
      + vsan_compression_enabled                              = false
      + vsan_dedup_enabled                                    = false
      + vsan_dit_encryption_enabled                           = false
      + vsan_dit_rekey_interval                               = (known after apply)
      + vsan_enabled                                          = true
      + vsan_network_diagnostic_mode_enabled                  = false
      + vsan_performance_enabled                              = false
      + vsan_unmap_enabled                                    = false
      + vsan_verbose_mode_enabled                             = false

      + vsan_disk_group {
          + cache   = (known after apply)
          + storage = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
vsphere_compute_cluster.vsan-cluster0: Creating...
vsphere_compute_cluster.vsan-cluster1: Creating...
vsphere_compute_cluster.vsan-cluster1: Still creating... [10s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [10s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [20s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [20s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [30s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [30s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [40s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [40s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [50s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [50s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [1m0s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [1m0s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [1m10s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [1m10s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [1m20s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [1m20s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [1m30s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [1m30s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [1m40s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [1m40s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [1m50s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [1m50s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [2m0s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [2m0s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [2m10s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [2m10s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [2m20s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [2m20s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [2m30s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [2m30s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [2m40s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [2m40s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [2m50s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [2m50s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [3m0s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [3m0s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [3m10s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [3m10s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [3m20s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [3m20s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [3m30s elapsed]
vsphere_compute_cluster.vsan-cluster1: Still creating... [3m30s elapsed]
vsphere_compute_cluster.vsan-cluster1: Creation complete after 3m32s [id=domain-c28]
vsphere_compute_cluster.vsan-cluster0: Still creating... [3m40s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still creating... [3m50s elapsed]
vsphere_compute_cluster.vsan-cluster0: Creation complete after 3m52s [id=domain-c29]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Downloads/vsan/cluster took 3m 59.3s 
➜ terraform plan                
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 1s [id=datacenter-3]
data.vsphere_datastore.vsan-ds1: Reading...
data.vsphere_datastore.vsan-ds0: Reading...
data.vsphere_host.hosts0[1]: Reading...
data.vsphere_host.hosts0[2]: Reading...
data.vsphere_host.hosts1[1]: Reading...
data.vsphere_host.hosts0[0]: Reading...
data.vsphere_host.hosts1[0]: Reading...
data.vsphere_host.hosts1[2]: Reading...
data.vsphere_datastore.vsan-ds0: Read complete after 0s [id=datastore-34]
data.vsphere_datastore.vsan-ds1: Read complete after 0s [id=datastore-33]
data.vsphere_host.hosts0[0]: Read complete after 1s [id=host-12]
data.vsphere_host.hosts1[0]: Read complete after 1s [id=host-17]
data.vsphere_host.hosts0[2]: Read complete after 1s [id=host-24]
data.vsphere_host.hosts1[2]: Read complete after 1s [id=host-14]
data.vsphere_host.hosts1[1]: Read complete after 1s [id=host-9]
vsphere_compute_cluster.vsan-cluster1: Refreshing state... [id=domain-c28]
data.vsphere_host.hosts0[1]: Read complete after 2s [id=host-16]
vsphere_compute_cluster.vsan-cluster0: Refreshing state... [id=domain-c29]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_compute_cluster.vsan-cluster0 will be updated in-place
  ~ resource "vsphere_compute_cluster" "vsan-cluster0" {
      ~ ha_enabled                                            = false -> true
        id                                                    = "domain-c29"
        name                                                  = "vsan-cluster0"
        tags                                                  = []
        # (57 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # vsphere_compute_cluster.vsan-cluster1 will be updated in-place
  ~ resource "vsphere_compute_cluster" "vsan-cluster1" {
      ~ ha_enabled                                            = false -> true
        id                                                    = "domain-c28"
        name                                                  = "vsan-cluster1"
        tags                                                  = []
        # (57 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.

Downloads/vsan/cluster took 8.4s 
➜ terraform apply --auto-approve
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_host.hosts1[2]: Reading...
data.vsphere_datastore.vsan-ds0: Reading...
data.vsphere_datastore.vsan-ds1: Reading...
data.vsphere_host.hosts1[1]: Reading...
data.vsphere_host.hosts1[0]: Reading...
data.vsphere_host.hosts0[2]: Reading...
data.vsphere_host.hosts0[1]: Reading...
data.vsphere_host.hosts0[0]: Reading...
data.vsphere_datastore.vsan-ds0: Read complete after 1s [id=datastore-34]
data.vsphere_datastore.vsan-ds1: Read complete after 1s [id=datastore-33]
data.vsphere_host.hosts1[0]: Read complete after 2s [id=host-17]
data.vsphere_host.hosts1[1]: Read complete after 2s [id=host-9]
data.vsphere_host.hosts1[2]: Read complete after 2s [id=host-14]
data.vsphere_host.hosts0[1]: Read complete after 2s [id=host-16]
vsphere_compute_cluster.vsan-cluster1: Refreshing state... [id=domain-c28]
data.vsphere_host.hosts0[2]: Read complete after 2s [id=host-24]
data.vsphere_host.hosts0[0]: Read complete after 2s [id=host-12]
vsphere_compute_cluster.vsan-cluster0: Refreshing state... [id=domain-c29]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_compute_cluster.vsan-cluster0 will be updated in-place
  ~ resource "vsphere_compute_cluster" "vsan-cluster0" {
      ~ ha_enabled                                            = false -> true
        id                                                    = "domain-c29"
        name                                                  = "vsan-cluster0"
        tags                                                  = []
        # (57 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # vsphere_compute_cluster.vsan-cluster1 will be updated in-place
  ~ resource "vsphere_compute_cluster" "vsan-cluster1" {
      ~ ha_enabled                                            = false -> true
        id                                                    = "domain-c28"
        name                                                  = "vsan-cluster1"
        tags                                                  = []
        # (57 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
vsphere_compute_cluster.vsan-cluster0: Modifying... [id=domain-c29]
vsphere_compute_cluster.vsan-cluster1: Modifying... [id=domain-c28]
vsphere_compute_cluster.vsan-cluster1: Still modifying... [id=domain-c28, 10s elapsed]
vsphere_compute_cluster.vsan-cluster0: Still modifying... [id=domain-c29, 10s elapsed]
╷
│ Error: Plugin did not respond
│ 
│   with vsphere_compute_cluster.vsan-cluster0,
│   on main.tf line 72, in resource "vsphere_compute_cluster" "vsan-cluster0":
│   72: resource "vsphere_compute_cluster" "vsan-cluster0" {
│ 
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain more
│ details.
╵
╷
│ Error: Plugin did not respond
│ 
│   with vsphere_compute_cluster.vsan-cluster1,
│   on main.tf line 89, in resource "vsphere_compute_cluster" "vsan-cluster1":
│   89: resource "vsphere_compute_cluster" "vsan-cluster1" {
│ 
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain more
│ details.
╵

Stack trace from the terraform-provider-vsphere plugin:

panic: runtime error: slice bounds out of range [:1] with capacity 0

goroutine 118 [running]:
github.com/hashicorp/terraform-provider-vsphere/vsphere/internal/helper/structure.DropSliceItem(...)
        /Users/johnsonryan/Library/Mobile Documents/com~apple~CloudDocs/Code/Work/terraform-provider-vsphere/vsphere/internal/helper/structure/structure_helper.go:577
github.com/hashicorp/terraform-provider-vsphere/vsphere.updateVsanDisks(0x21bdd80?, 0xc0003c9b90?, {0x1cdc6a0?, 0xc0006bb260?})
        /Users/johnsonryan/Library/Mobile Documents/com~apple~CloudDocs/Code/Work/terraform-provider-vsphere/vsphere/resource_vsphere_compute_cluster.go:1521 +0x15dc
github.com/hashicorp/terraform-provider-vsphere/vsphere.resourceVSphereComputeClusterApplyVsanConfig(0x2009a36?, {0x1cdc6a0?, 0xc0006bb260}, 0xc0001ea280)
        /Users/johnsonryan/Library/Mobile Documents/com~apple~CloudDocs/Code/Work/terraform-provider-vsphere/vsphere/resource_vsphere_compute_cluster.go:1463 +0x565
github.com/hashicorp/terraform-provider-vsphere/vsphere.resourceVSphereComputeClusterApplyClusterConfiguration(0x21ba8c0?, {0x1cdc6a0?, 0xc0006bb260}, 0xc0001ea280?)
        /Users/johnsonryan/Library/Mobile Documents/com~apple~CloudDocs/Code/Work/terraform-provider-vsphere/vsphere/resource_vsphere_compute_cluster.go:924 +0xea
github.com/hashicorp/terraform-provider-vsphere/vsphere.resourceVSphereComputeClusterUpdate(0x0?, {0x1cdc6a0, 0xc0006bb260})
        /Users/johnsonryan/Library/Mobile Documents/com~apple~CloudDocs/Code/Work/terraform-provider-vsphere/vsphere/resource_vsphere_compute_cluster.go:673 +0x12c
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).update(0x21c3c90?, {0x21c3c90?, 0xc000a0d140?}, 0xd?, {0x1cdc6a0?, 0xc0006bb260?})
        /Users/johnsonryan/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.17.0/helper/schema/resource.go:729 +0x178
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0xc0000ba7e0, {0x21c3c90, 0xc000a0d140}, 0xc000544a90, 0xc000919580, {0x1cdc6a0, 0xc0006bb260})
        /Users/johnsonryan/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.17.0/helper/schema/resource.go:847 +0x83a
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ApplyResourceChange(0xc000239a88, {0x21c3be8?, 0xc00044c680?}, 0xc0006532c0)
        /Users/johnsonryan/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.17.0/helper/schema/grpc_provider.go:1021 +0xe8d
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ApplyResourceChange(0xc0001a4fa0, {0x21c3c90?, 0xc000a0c960?}, 0xc0009160e0)
        /Users/johnsonryan/go/pkg/mod/github.com/hashicorp/terraform-plugin-go@v0.9.1/tfprotov5/tf5server/server.go:812 +0x515
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ApplyResourceChange_Handler({0x1f673c0?, 0xc0001a4fa0}, {0x21c3c90, 0xc000a0c960}, 0xc0001b0ae0, 0x0)
        /Users/johnsonryan/go/pkg/mod/github.com/hashicorp/terraform-plugin-go@v0.9.1/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:385 +0x170
google.golang.org/grpc.(*Server).processUnaryRPC(0xc0000cc8c0, {0x21c7858, 0xc0002d2d00}, 0xc0001ce120, 0xc000611470, 0x2ae98a0, 0x0)
        /Users/johnsonryan/go/pkg/mod/google.golang.org/grpc@v1.46.0/server.go:1283 +0xcfe
google.golang.org/grpc.(*Server).handleStream(0xc0000cc8c0, {0x21c7858, 0xc0002d2d00}, 0xc0001ce120, 0x0)
        /Users/johnsonryan/go/pkg/mod/google.golang.org/grpc@v1.46.0/server.go:1620 +0xa2f
google.golang.org/grpc.(*Server).serveStreams.func1.2()
        /Users/johnsonryan/go/pkg/mod/google.golang.org/grpc@v1.46.0/server.go:922 +0x98
created by google.golang.org/grpc.(*Server).serveStreams.func1
        /Users/johnsonryan/go/pkg/mod/google.golang.org/grpc@v1.46.0/server.go:920 +0x28a

Error: The terraform-provider-vsphere plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.
```